Autodesk.Revit.DB.CylindricalHelix.getGCylindricalHelix
Obtain the native GCylindricalHelix

Autodesk.Revit.DB.CylindricalHelix.Height
Height of the cylindrical helix.
Remarks:
It is the length of the span of the helix along the axis direction.
The height is defined only if the helix is bounded.
That is, its start and end angles (parameters) are specified.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Height is not defined for unbounded helix.

Autodesk.Revit.DB.CylindricalHelix.IsRightHanded
True if the helix is right handed, false if the helix is left handed.

Autodesk.Revit.DB.CylindricalHelix.Pitch
The pitch of the cylindrical helix.
Remarks:
It is the distance moved along the axis direction when a point makes one rotation about the axis.
Pitch can be positive or negative.

Autodesk.Revit.DB.CylindricalHelix.ZVector
The Z direction vector, which is same as the axis direction vector.

Autodesk.Revit.DB.CylindricalHelix.YVector
The Y direction vector.

Autodesk.Revit.DB.CylindricalHelix.XVector
The X direction vector.

Autodesk.Revit.DB.CylindricalHelix.Radius
The radius of the cylindrical helix.

Autodesk.Revit.DB.CylindricalHelix.BasePoint
The base point of the axis of the cylindrical helix.

Autodesk.Revit.DB.CylindricalHelix.Create(Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double)
Create a cylindrical helix.
basePoint:   Base point of the axis. It can be any point in 3d.
radius:      Radius. It should be a positive number.
xVector:     X vector. Should be Non-zero vector.
zVector:     Z vector = axis direction. Should be non-zero and orthogonal to X Vector.
pitch:       Pitch. It should be non-zero number, can be positive or negative.
Positive means right handed and negative means left handed.
startAngle:  Start angle. It specifies the start point of the Helix.
endAngle:    End angle. It specifies the end point of the Helix.
End angle should not be equal to start angle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The radius is negative -or-
the pitch is zero -or-
the xVector or zVector is zero length -or-
zVector is not orthogonal to xVector -or-
endAngle is equal to startAngle.

Autodesk.Revit.DB.CylindricalHelix
A cylindrical helix.
Remarks:
The helix winds around a cylinder making constant angle with the axis of the cylinder.
In this release, CylindricalHelix curves are used only in specific applications in
stairs and railings, and should not be used or encountered when accessing curves of
other Revit elements and geometry.
Since: 2013